/*캘린더 UI*/

#define _CRT_SECURE_NO_WARNINGS
#include<iostream>
#include<Windows.h>
#include<string>
#include<iomanip>

using namespace std;

int main()
{
    system("mode con cols=150 lines=50");

    cout << endl << endl;
    cout << setw(78) << "11월" << endl << endl << endl;

    cout << "\t\t\t\t\t" << " ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ " << endl;
    cout << setw(42) << "ㅣ" << " 일요일 " << "ㅣ" << " 월요일 " << "ㅣ" << " 화요일 " << "ㅣ" << " 수요일 " << "ㅣ" << " 목요일 " << "ㅣ" << " 금요일 " << "ㅣ" << " 토요일 " << "ㅣ" << endl;

    
     cout << "\t\t\t\t\t" << " ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ " << endl;
     cout << setw(42) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << endl;
     cout << setw(42) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << "   01   " << "ㅣ" << "   02   " << "ㅣ" << "   03   " << "ㅣ" << "   04   " << "ㅣ" << "   05   " << "ㅣ" << endl;
     cout << setw(42) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << endl;
     cout << "\t\t\t\t\t" << " ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ " << endl;
     cout << setw(42) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << endl;
     cout << setw(42) << "ㅣ" << "   06   " << "ㅣ" << "   07   " << "ㅣ" << "   08   " << "ㅣ" << "   09   " << "ㅣ" << "   10   " << "ㅣ" << "   11   " << "ㅣ" << "   12   " << "ㅣ" << endl;
     cout << setw(42) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << endl;
     cout << "\t\t\t\t\t" << " ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ " << endl;
     cout << setw(42) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << endl;
     cout << setw(42) << "ㅣ" << "   13   " << "ㅣ" << "   14   " << "ㅣ" << "   15   " << "ㅣ" << "   16   " << "ㅣ" << "   17   " << "ㅣ" << "   18   " << "ㅣ" << "   19   " << "ㅣ" << endl;
     cout << setw(42) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << endl;
     cout << "\t\t\t\t\t" << " ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ " << endl;
     cout << setw(42) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << endl;
     cout << setw(42) << "ㅣ" << "   20   " << "ㅣ" << "   21   " << "ㅣ" << "   22   " << "ㅣ" << "   23   " << "ㅣ" << "   24   " << "ㅣ" << "   25   " << "ㅣ" << "   26   " << "ㅣ" << endl;
     cout << setw(42) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << endl;
     cout << "\t\t\t\t\t" << " ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ " << endl;
     cout << setw(42) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << endl;
     cout << setw(42) << "ㅣ" << "   27   " << "ㅣ" << "   28   " << "ㅣ" << "   29   " << "ㅣ" << "   30   " << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << endl;
     cout << setw(42) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << setw(10) << "ㅣ" << endl;
     cout << "\t\t\t\t\t" << " ㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡㅡ " << endl;

     cout << endl;

     cout << "\t\t\t\t\t\t\t" << "메인화면으로 돌아가려면 'm' 키를 누르세요." << endl << endl;
}